-- phpMyAdmin SQL Dump
-- version 4.1.14
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2016-05-26 11:00:13
-- 服务器版本： 5.6.17
-- PHP Version: 5.5.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `news`
--
CREATE DATABASE IF NOT EXISTS `news` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `news`;

-- --------------------------------------------------------

--
-- 表的结构 `n_category`
--

DROP TABLE IF EXISTS `n_category`;
CREATE TABLE IF NOT EXISTS `n_category` (
  `c_id` int(5) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `c_name` varchar(100) NOT NULL COMMENT '栏目名称',
  `c_show` int(10) NOT NULL COMMENT '是否显示',
  PRIMARY KEY (`c_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=7 ;

--
-- 转存表中的数据 `n_category`
--

INSERT INTO `n_category` (`c_id`, `c_name`, `c_show`) VALUES
(1, '推荐', 1),
(2, '百家', 1),
(3, '本地', 1),
(4, '图片', 1),
(5, '娱乐', 1),
(6, '社会', 1);

-- --------------------------------------------------------

--
-- 表的结构 `n_list`
--

DROP TABLE IF EXISTS `n_list`;
CREATE TABLE IF NOT EXISTS `n_list` (
  `n_id` int(5) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `c_id` int(5) NOT NULL COMMENT '栏目ID',
  `n_title` varchar(100) NOT NULL COMMENT '新闻标题',
  `n_desc` varchar(200) NOT NULL COMMENT '新闻摘要',
  `n_pic` varchar(100) NOT NULL COMMENT '图片地址',
  `n_date` varchar(200) NOT NULL COMMENT '日期',
  PRIMARY KEY (`n_id`),
  KEY `c_id` (`c_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=66 ;

--
-- 转存表中的数据 `n_list`
--

INSERT INTO `n_list` (`n_id`, `c_id`, `n_title`, `n_desc`, `n_pic`, `n_date`) VALUES
(3, 1, '董明珠：业绩下滑是“主动让利”结果', '对于去年的销售额下滑了390多亿元，董明珠说这是格力主动让利的结果，但是我们有史以来实现了市场...', '120_229924_87e8624297bf4cf3de848d72cc352cc9.jpg', '1463492115'),
(4, 1, '马云生在东北那旮旯会如何？', '“没有东北此前对社会物质财富积累作出的贡献，马云不可能出现……”。', '2016051714243168695.jpg', '1463492223'),
(5, 1, '乐视推出大屏购，依靠生态闭环乐视能否加码市场争夺战？', '乐视宣布超级电视日均CV已连续一周破亿，超越乐视PC端、移动端、M站成为乐视第一大流量终端平台。', '20160517175118.jpg', '1463492262'),
(6, 1, '媒体:各地纪委都怎么给官员夫人们上廉政课', '湖南举行“廉政家风”座谈会，省纪委书记傅奎与140名厅官夫人对话，让其“看好自家门”。', '', '1463492380'),
(7, 1, '京东众筹：小牛电动车8176万众筹夺冠', '再次刷新全国产品众筹总额之最，超越了去年自创的7202万纪录，成为京东众筹众创生态圈孵化出又一...', 'abe9ed29da45a91e.jpg', '1463492440'),
(8, 1, '乐视超级电视4月销量大涨 排名行业全渠道第一', '2015年919黑色乐迷节总销量突破38.2万台;2015年双11总销量38.6万台;2015...', 'W020160517719863734697.png', '1463492494'),
(9, 2, '民间投资出现雪崩，问题究竟在哪儿？', '民间投资出现增速放缓、占比下降的问题，责任在地方政府，在地方对待民间资本的态度。', 'dcc451da81cb39dba027efbcd7160924aa183070.jpg', '1463492594'),
(10, 2, '专访海底捞张勇：CEO就不该管基层的事', '海底捞最具可能的两种死法：一种是管理出问题，如果发生，死亡过程可能持续数月乃至上年；第二种是食...', 'd1160924ab18972bf2738620e1cd7b899f510a8a.jpg', '1463637356'),
(11, 3, '北京城际铁路S6线拟设站17座 2019年底竣工', '线路初步考虑设站17座，其中北京境内15座，廊坊境内2座。', '', '1463492683'),
(12, 3, '北京中小学数独比赛落幕 “王中王”赢得课程奖学金', '四个组别的冠军同台PK，人大附中戴潭潭获得了数独“王中王”的称号，并赢得6000元的课程奖学金。', '', '1463492704'),
(13, 1, '北京警方“春夏平安行动”显成效 查获涉毒人员599名', '立即展开布控，于5月10日9时，在某检查站将该名男子抓获，从其驾驶轿车中起获冰毒977.5克。', '', '1463492721'),
(14, 3, '北京警方“春夏平安行动”显成效 查获涉毒人员599名', '立即展开布控，于5月10日9时，在某检查站将该名男子抓获，从其驾驶轿车中起获冰毒977.5克。', '', '1463492740'),
(16, 4, '越南在南沙10个岛礁大肆填海造岛', '', '2.jpg', '1463637182'),
(17, 1, '中国穷女孩逆袭 变身“美国房姐”', '', 'timg1111.jpg', '1463636778'),
(18, 4, '王心凌素颜变脸：认不出', '王心凌素颜变脸：认不出', 'timg1111.jpg', '1463635383'),
(19, 5, '台湾业界欲整合无人机产业提升竞争力 ', '业内人士估计，目前台湾无人机产业链以及相关应用市场规模约1000亿元新台币。', '', '1463492955'),
(20, 5, '明星去戛纳闹笑话被黄牛坑了', '法国当地时间5月14日晚，因闹乌龙没能现身戛纳开幕红毯的井柏然，终于穿上准备了好几天的礼服走上红毯。', '74485_1364841_855305.jpg', '1463493221'),
(21, 6, '北京一男子在银行内滋事被抓 警方：系精神病人', '朝阳区武圣路一家银行内，一名男子持械滋事被警方控制。', '1463453186105565.jpg', '1463493256'),
(22, 6, '“因为有爱 所以幸福” ', '他用“百善孝为先”的原则来要求自己，并以此来教育孩子，从小让孩子充满正义感和爱心。', 'res05_attpic_brief.jpg', '1463530591'),
(23, 2, '王福重：高考，应该照顾落后地区吗', '跟体育比赛一样，分数面前人人平等，取消分省计划、实行统一命题、取消地区照顾，才是中国高考长治久...', 'aec379310a55b319b463229944a98226cefc1747.jpg', '1463582396'),
(24, 2, '地球的振动模式 ', '4月16日拉美国家厄瓜多尔发生7.8级地震，而这不过是近期地球上一系列地震中震级最强、伤亡人数...', 'fcfaaf51f3deb48f6e353d32f71f3a292cf578fa.jpg', '1463582511'),
(25, 1, '《三体》时代，当人类接近生存穹顶', '中国作者如何能够创造出某种非西方中心的知识，并进而重新理解中国的现实、想象中国的未来。', 'fcfaaf51f3deb48f0de79e23f71f3a292cf57844.jpg', '1463582787'),
(26, 2, '反假货联盟一月游：阿里与国际品牌的撕裂', '阿里加入联盟后将有助于联盟成员之间打假上的沟通，能够更好处理全球的假货问题。', '42a98226cffc1e17f2583bdd4d90f603728de973.jpg', '1463582909'),
(27, 2, '如何理解阿里影业联姻大地和淘宝电影变形？', '阿里影业与大地影院达成战略合作，半年后，阿里影业以投资企业可转债的方式与大地影院更紧密的绑定，...', '838ba61ea8d3fd1fb0d02cd1374e251f94ca5f04.jpg', '1463582958'),
(28, 2, '距知识分享型付费问答时代到来还有多远？', '知识分享型网站的盈利探索或商业化转型，最重要的还是要站在绝大多数用户的基础上，为用户提供路径或方式。', '242dd42a2834349bde8c2b69ceea15ce37d3be50.jpg', '1463583035'),
(29, 2, '李嘉诚病了 旗下公司市值缩水400亿', '尽管这些年遭遇了一些声誉危机，但年近90的李超人对香港股市乃至整个香港仍然举足轻重。', '738b4710b912c8fc8f5bb526fb039245d78821b4.jpg', '1463583082'),
(30, 3, '去年捐100万设道德基金 苍南国土局公务员高调做慈善', '他在决定捐出100万元时曾说，我的钱来得干净，不怕查；捐出去做公益，就为图个好名声。', '', '1463583160'),
(31, 3, '北京男子送沙手筋遭沙霸砍断 多嫌犯已被警方刑拘', '该事件疑是附近一小区“沙霸”所为，此后警方介入调查。', '', '1463583182'),
(32, 3, '北京中心城每天约50万方污水直排 官方推进治理', '官方要求2030年80%以上的城市建成区，要达到海绵城市标准。', '', '1463583200'),
(33, 4, '货车高速上起火 30吨梨子烧成烤梨', '', '3.jpg', '1463637217'),
(34, 4, '马英九“头顶鹿茸”回应糗事：我错了', '', '1.jpg', '1463637136'),
(35, 4, '委内瑞拉经济崩盘 中国答应给钱', '', 'timg (2).jpg', '1463583335'),
(37, 5, '黄志忠亲身授课 梁大维秒变“一年级生”', '由北京星河文化旗下九位戏骨：黄志忠、李乃文、柯蓝、刘琳、王鑫、梁大维、刘立伟。', '134641631.jpg', '1463583445'),
(38, 5, '刘亦菲顶花苞头花式卖萌 天仙攻变娇俏萌妹', '环球娱乐网5月17日报道 今日，刘亦菲、刘烨、余少群出席电影《夜孔雀》新闻发布会。刘亦菲顶花苞...', '', '1463583472'),
(39, 5, '宋仲基为什么一定要来中国还愿？', '宋仲基“亚洲粉丝见面会”的票价被炒到6800元，是原票价的六倍。', '93798072.png', '1463583512'),
(40, 5, '章子怡女儿躺婴儿车午睡 爱犬趴旁边静静守候(图)', '照片中的醒醒，乖乖躺在婴儿车中睡觉，而章子怡的宠物狗则趴在旁边守候小主人。', '9095906717237399467.bmp', '1463583561'),
(41, 6, '12条城市主干道', '工人正在朝阳公园旁东四环辅路进行沥青铺装摄/记者', '20160513100625.png', '1463635182'),
(42, 6, '李敏镐将作为公益兵入伍 公司:时间未定', '李敏镐过去曾经经历过交通事故，虽然日常生活没有影响，但是动作戏会有不便。', 'rQrt-fxrtztr3689242.jpg', '1463637048'),
(43, 6, '《夜孔雀》《钢刀》上映 刘亦菲演绎三段情 何润东剃光头 ', '何润东、李东学亮相《钢刀》首映式。', '1843382680.jpg', '1463636996'),
(48, 2, '''''''搜房借壳上市遭狙击 道杰士提商标纠纷实为“碰瓷”?', '并不是模仿了道杰士公司的模式或者因为商标竞争而引发的结果，李忠所说的受害者形象，与这些都匹配不...', '48540923dd54564ebc5ebfd7b4de9c82d1584f20.jpg', '1463639637');

-- --------------------------------------------------------

--
-- 表的结构 `n_user`
--

DROP TABLE IF EXISTS `n_user`;
CREATE TABLE IF NOT EXISTS `n_user` (
  `u_id` tinyint(4) NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `u_name` varchar(100) NOT NULL COMMENT '用户名',
  `u_pwd` varchar(200) NOT NULL COMMENT '密码',
  PRIMARY KEY (`u_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- 转存表中的数据 `n_user`
--

INSERT INTO `n_user` (`u_id`, `u_name`, `u_pwd`) VALUES
(1, 'admin', '21232f297a57a5a743894a0e4a801fc3');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
